# 10차시 : 고객정보 병합 및 파일 비교

---

## 1. 고객정보 병합

#### 고객기본정보.xlsx 파일과 고객부가정보.xlsx 파일을 고객번호 기준으로 병합

- 두 데이터프레임을 Key 컬럼값을 기준으로 병합
- 중복된 Key 값이 있으면 이상 데이터들이 생성되므로 중복제거
- 두 데이터프레임의 Key 컬럼명은 서로 동일

### 1.1 중복 고객정보 제거

In [1]:
import pandas as pd

In [2]:
고객기본정보 = pd.read_excel('../데이터/고객기본정보.xlsx')

In [3]:
고객기본정보[:5]

   고객번호     성명       영문명           전화번호                메일주소                주소
0  C001    제우스      Zeus  010-1111-2222        zeus@abc.com  서울시 강서구 화곡동 22-5
1  C002     헤라      Hera  010-2222-3333        hera@bcd.com  서울시 강남구 역삼동 13-4
2  C003   데메테르   Demeter  010-3333-4444  demeter@def.cc.com  서울시 송파구 잠실동 15-5
3  C004  디오니소스  Dionysos  010-4444-5555    dionysos@efg.com  서울시 성북구 성북동 22-1
4  C005    아레스      Ares  010-5555-6666        ares@fgh.com  서울시 강동구 상일동 10-3

#### len함수를 이용하여 데이터프레임 행수 확인

In [4]:
len(고객기본정보)

14

#### unique함수를 이용하여 고객번호 컬럼의 유일한 값 목록 확인

In [5]:
pd.unique(고객기본정보.고객번호)

array(['C001', 'C002', 'C003', 'C004', 'C005', 'C006', 'C007', 'C008',
       'C009', 'C010', 'C011', 'C012'], dtype=object)

#### len함수를 이용하여 고객번호 컬럼의 유일한 값의 갯수 확인

In [6]:
len(pd.unique(고객기본정보.고객번호))

12

#### duplicated 함수를 이용하여 중복 고객정보 확인

- 데이터프레임내 Key 컬럼을 기준으로 중복된 값 확인
- duplicated 함수 사용
- 데이터프레임명.duplicated('Key컬럼명', keep='first 혹은 last') 형태로 사용
- first : 처음의 값을 제외하고 그 이후 값들이 중복임
- last : 마지막 값을 제외하고 그 이후 값들이 중복임
- 중복을 제외하기 위해 부정연산자인 ~ 사용

In [7]:
고객기본정보[(고객기본정보.고객번호=='C001') | (고객기본정보.고객번호=='C007')]

    고객번호   성명     영문명           전화번호            메일주소                주소
0   C001  제우스    Zeus  010-1111-2222    zeus@abc.com  서울시 강서구 화곡동 22-5
6   C007  아테나  Athena  010-7777-8888  athena@hij.com   인천시 동구 만석동 32-1
12  C001  제우스    Zeus  010-1111-2222    zeus@abc.com   서울시 양천구 목동 12-3
13  C007  아테나  Athena  010-7777-8888  athena@hij.com   인천시 남구 도화동 36-9

In [8]:
고객기본정보[고객기본정보.duplicated('고객번호', keep='last')]

   고객번호   성명     영문명           전화번호            메일주소                주소
0  C001  제우스    Zeus  010-1111-2222    zeus@abc.com  서울시 강서구 화곡동 22-5
6  C007  아테나  Athena  010-7777-8888  athena@hij.com   인천시 동구 만석동 32-1

#### 중복을 제외하고 중복되지 않은 값들만 저장

In [9]:
고객기본정보[~고객기본정보.duplicated('고객번호', keep='last')]

,고객번호,성명,영문명,전화번호,메일주소,주소
1,C002,헤라,Hera,010-2222-3333,hera@bcd.com,서울시 강남구 역삼동 13-4
2,C003,데메테르,Demeter,010-3333-4444,demeter@def.cc.com,서울시 송파구 잠실동 15-5
3,C004,디오니소스,Dionysos,010-4444-5555,dionysos@efg.com,서울시 성북구 성북동 22-1
4,C005,아레스,Ares,010-5555-6666,ares@fgh.com,서울시 강동구 상일동 10-3
5,C006,아르테미스,Artemis,010-6666-7777,artemis@ghi.com,서울시 강서구 방화동 29-7
7,C008,아폴론,Apollon,010-8888-9999,apollon@ijk.com,대전시 중구 은행동 34-5
8,C009,아프로디테,Aphrodite,010-9999-1010,aphrodite@jkl.com,부산시 부산진구 양정동 59-7
9,C010,포세이돈,Poseidon,010-1010-2020,poseidon@klm.com,대구시 수성구 범어동 78-2
10,C011,헤르메스,Hermes,010-2020-3030,hermes@lmn.com,광주시 남구 월산동 23-5
11,C012,헤파이스토스,Hephaistos,010-3030-4040,hephaistos@mno.com,제주시 용강동 11-1
12,C001,제우스,Zeus,010-1111-2222,zeus@abc.com,서울시 양천구 목동 12-3
13,C007,아테나,Athena,010-7777-8888,athena@hij.com,인천시 남구 도화동 36-9

In [10]:
중복제거고객기본정보 = 고객기본정보[~고객기본정보.duplicated('고객번호', keep='last')]

In [11]:
중복제거고객기본정보

,고객번호,성명,영문명,전화번호,메일주소,주소
1,C002,헤라,Hera,010-2222-3333,hera@bcd.com,서울시 강남구 역삼동 13-4
2,C003,데메테르,Demeter,010-3333-4444,demeter@def.cc.com,서울시 송파구 잠실동 15-5
3,C004,디오니소스,Dionysos,010-4444-5555,dionysos@efg.com,서울시 성북구 성북동 22-1
4,C005,아레스,Ares,010-5555-6666,ares@fgh.com,서울시 강동구 상일동 10-3
5,C006,아르테미스,Artemis,010-6666-7777,artemis@ghi.com,서울시 강서구 방화동 29-7
7,C008,아폴론,Apollon,010-8888-9999,apollon@ijk.com,대전시 중구 은행동 34-5
8,C009,아프로디테,Aphrodite,010-9999-1010,aphrodite@jkl.com,부산시 부산진구 양정동 59-7
9,C010,포세이돈,Poseidon,010-1010-2020,poseidon@klm.com,대구시 수성구 범어동 78-2
10,C011,헤르메스,Hermes,010-2020-3030,hermes@lmn.com,광주시 남구 월산동 23-5
11,C012,헤파이스토스,Hephaistos,010-3030-4040,hephaistos@mno.com,제주시 용강동 11-1
12,C001,제우스,Zeus,010-1111-2222,zeus@abc.com,서울시 양천구 목동 12-3
13,C007,아테나,Athena,010-7777-8888,athena@hij.com,인천시 남구 도화동 36-9

#### 인덱스 재생성

In [12]:
중복제거고객기본정보 = 중복제거고객기본정보.reset_index(drop = True)

In [13]:
중복제거고객기본정보

,고객번호,성명,영문명,전화번호,메일주소,주소
0,C002,헤라,Hera,010-2222-3333,hera@bcd.com,서울시 강남구 역삼동 13-4
1,C003,데메테르,Demeter,010-3333-4444,demeter@def.cc.com,서울시 송파구 잠실동 15-5
2,C004,디오니소스,Dionysos,010-4444-5555,dionysos@efg.com,서울시 성북구 성북동 22-1
3,C005,아레스,Ares,010-5555-6666,ares@fgh.com,서울시 강동구 상일동 10-3
4,C006,아르테미스,Artemis,010-6666-7777,artemis@ghi.com,서울시 강서구 방화동 29-7
5,C008,아폴론,Apollon,010-8888-9999,apollon@ijk.com,대전시 중구 은행동 34-5
6,C009,아프로디테,Aphrodite,010-9999-1010,aphrodite@jkl.com,부산시 부산진구 양정동 59-7
7,C010,포세이돈,Poseidon,010-1010-2020,poseidon@klm.com,대구시 수성구 범어동 78-2
8,C011,헤르메스,Hermes,010-2020-3030,hermes@lmn.com,광주시 남구 월산동 23-5
9,C012,헤파이스토스,Hephaistos,010-3030-4040,hephaistos@mno.com,제주시 용강동 11-1
10,C001,제우스,Zeus,010-1111-2222,zeus@abc.com,서울시 양천구 목동 12-3
11,C007,아테나,Athena,010-7777-8888,athena@hij.com,인천시 남구 도화동 36-9

In [14]:
중복제거고객기본정보 = 중복제거고객기본정보.sort_values('고객번호', ascending=True)
중복제거고객기본정보

,고객번호,성명,영문명,전화번호,메일주소,주소
10,C001,제우스,Zeus,010-1111-2222,zeus@abc.com,서울시 양천구 목동 12-3
0,C002,헤라,Hera,010-2222-3333,hera@bcd.com,서울시 강남구 역삼동 13-4
1,C003,데메테르,Demeter,010-3333-4444,demeter@def.cc.com,서울시 송파구 잠실동 15-5
2,C004,디오니소스,Dionysos,010-4444-5555,dionysos@efg.com,서울시 성북구 성북동 22-1
3,C005,아레스,Ares,010-5555-6666,ares@fgh.com,서울시 강동구 상일동 10-3
4,C006,아르테미스,Artemis,010-6666-7777,artemis@ghi.com,서울시 강서구 방화동 29-7
11,C007,아테나,Athena,010-7777-8888,athena@hij.com,인천시 남구 도화동 36-9
5,C008,아폴론,Apollon,010-8888-9999,apollon@ijk.com,대전시 중구 은행동 34-5
6,C009,아프로디테,Aphrodite,010-9999-1010,aphrodite@jkl.com,부산시 부산진구 양정동 59-7
7,C010,포세이돈,Poseidon,010-1010-2020,poseidon@klm.com,대구시 수성구 범어동 78-2
8,C011,헤르메스,Hermes,010-2020-3030,hermes@lmn.com,광주시 남구 월산동 23-5
9,C012,헤파이스토스,Hephaistos,010-3030-4040,hephaistos@mno.com,제주시 용강동 11-1

---

### 1.2 데이터프레임 컬럼명 변경

In [15]:
고객부가정보 = pd.read_excel('../데이터/고객부가정보.xlsx')

In [16]:
고객부가정보[:3]

   고객ID         생일     예금잔액      대출잔액        등록일
0  C001 1965-02-03  1000000  10000000 2015-05-01
1  C002 1974-09-23  1500000   9000000 2016-08-24
2  C003 1978-12-20  2000000   8000000 2018-06-02

#### 고객부가정보 Key컬럼명 변경
- 데이터프레임명.rename(columns={'변경전컬럼명':'변경후컬럼명'}, inplace=True)
- columns는 딕셔너리 값으로 지정되므로 여러 컬럼명을 동시에 변경 가능
- inplace = True 는 즉시 변경되도록 하기 위해 반드시 필요

In [17]:
고객부가정보.rename(columns={'고객ID' :'고객번호'}, inplace=True)

In [18]:
고객부가정보[:3]

   고객번호         생일     예금잔액      대출잔액        등록일
0  C001 1965-02-03  1000000  10000000 2015-05-01
1  C002 1974-09-23  1500000   9000000 2016-08-24
2  C003 1978-12-20  2000000   8000000 2018-06-02

### 1.3 고객정보 병합

- pd.merge(데이터프레임1, 데이터프레임2, on=['Key컬럼명'])
- Key 컬럼을 기준으로 데이터들이 연결되어 새로운 데이터프레임 생성

In [19]:
고객정보병합 = pd.merge(중복제거고객기본정보, 고객부가정보, on=['고객번호'])

In [20]:
고객정보병합

,고객번호,성명,영문명,전화번호,메일주소,주소,생일,예금잔액,대출잔액,등록일
0,C001,제우스,Zeus,010-1111-2222,zeus@abc.com,서울시 양천구 목동 12-3,1965-02-03,1000000,10000000,2015-05-01
1,C002,헤라,Hera,010-2222-3333,hera@bcd.com,서울시 강남구 역삼동 13-4,1974-09-23,1500000,9000000,2016-08-24
2,C003,데메테르,Demeter,010-3333-4444,demeter@def.cc.com,서울시 송파구 잠실동 15-5,1978-12-20,2000000,8000000,2018-06-02
3,C004,디오니소스,Dionysos,010-4444-5555,dionysos@efg.com,서울시 성북구 성북동 22-1,1972-05-30,2500000,7000000,2017-12-23
4,C005,아레스,Ares,010-5555-6666,ares@fgh.com,서울시 강동구 상일동 10-3,1988-03-09,3000000,6000000,2015-09-07
5,C006,아르테미스,Artemis,010-6666-7777,artemis@ghi.com,서울시 강서구 방화동 29-7,1970-12-01,3500000,5000000,2016-01-06
6,C007,아테나,Athena,010-7777-8888,athena@hij.com,인천시 남구 도화동 36-9,1990-07-12,4000000,4000000,2018-05-08
7,C008,아폴론,Apollon,010-8888-9999,apollon@ijk.com,대전시 중구 은행동 34-5,1982-06-12,4500000,3000000,2018-02-24
8,C009,아프로디테,Aphrodite,010-9999-1010,aphrodite@jkl.com,부산시 부산진구 양정동 59-7,1991-04-07,5000000,2000000,2017-11-21
9,C010,포세이돈,Poseidon,010-1010-2020,poseidon@klm.com,대구시 수성구 범어동 78-2,1987-01-18,5500000,1000000,2016-03-11
10,C011,헤르메스,Hermes,010-2020-3030,hermes@lmn.com,광주시 남구 월산동 23-5,1995-09-07,6000000,500000,2015-04-11
11,C012,헤파이스토스,Hephaistos,010-3030-4040,hephaistos@mno.com,제주시 용강동 11-1,1966-08-03,6500000,300000,2016-10-05

---

## 2. 고객정보 파일 비교

### 1.1 데이터프레임 인덱스 변경

- 데이터프레임의 인덱스 번호는 0부터 시작
- 엑셀 행번호는 2부터 시작
- 라인번호 일치를 위해 데이터프레임 인덱스 번호를 2부터 시작하도록 변경

In [21]:
고객정보_V1 = pd.read_excel('../데이터/고객정보_V1.xlsx')

In [22]:
고객정보_V2 = pd.read_excel('../데이터/고객정보_V2.xlsx')

In [23]:
고객정보_V1[:3]

,고객번호,성명,영문명,전화번호,메일주소,주소,생일,예금잔액,대출잔액,등록일
0,C001,제우스,Zeus,010-1111-2222,zeus@abc.com,서울시 강서구 화곡동 22-5,1965-02-03,1000000,10000000,2015-05-01
1,C002,헤라,Hera,010-2222-3333,hera@bcd.com,서울시 강남구 역삼동 13-4,1974-09-23,1500000,9000000,2016-08-24
2,C003,데메테르,Demeter,010-3333-4444,demeter@def.cc.com,서울시 송파구 잠실동 15-5,1978-12-20,2000000,8500000,2018-06-02

In [24]:
고객정보_V2[:3]

,고객번호,성명,영문명,전화번호,메일주소,주소,생일,예금잔액,대출잔액,등록일
0,C001,제우스,Zeus,010-1111-1111,zeus@abc.com,서울시 양천구 목동 12-3,1965-02-03,1000000,10000000,2015-05-01
1,C002,헤라,Hera,010-2222-3333,hera@bcd.com,서울시 강남구 역삼동 13-4,1974-09-23,1500000,9000000,2016-08-24
2,C003,데메테르,Demeter,010-3333-4444,demeter@def.cc.com,서울시 송파구 잠실동 15-5,1978-12-20,2000000,8000000,2018-06-02

#### 데이터프레임 인덱스 번호 2로 시작하도록 변경

In [25]:
고객정보_V1.index

RangeIndex(start=0, stop=12, step=1)

In [26]:
고객정보_V1.index = 고객정보_V2.index + 2
고객정보_V1.index

RangeIndex(start=2, stop=14, step=1)

In [27]:
고객정보_V2.index

RangeIndex(start=0, stop=12, step=1)

In [28]:
고객정보_V2.index = 고객정보_V2.index + 2
고객정보_V2.index

RangeIndex(start=2, stop=14, step=1)

#### 변경된 인덱스 번호 확인

In [29]:
고객정보_V1[:3]

,고객번호,성명,영문명,전화번호,메일주소,주소,생일,예금잔액,대출잔액,등록일
2,C001,제우스,Zeus,010-1111-2222,zeus@abc.com,서울시 강서구 화곡동 22-5,1965-02-03,1000000,10000000,2015-05-01
3,C002,헤라,Hera,010-2222-3333,hera@bcd.com,서울시 강남구 역삼동 13-4,1974-09-23,1500000,9000000,2016-08-24
4,C003,데메테르,Demeter,010-3333-4444,demeter@def.cc.com,서울시 송파구 잠실동 15-5,1978-12-20,2000000,8500000,2018-06-02

In [30]:
고객정보_V2[:3]

,고객번호,성명,영문명,전화번호,메일주소,주소,생일,예금잔액,대출잔액,등록일
2,C001,제우스,Zeus,010-1111-1111,zeus@abc.com,서울시 양천구 목동 12-3,1965-02-03,1000000,10000000,2015-05-01
3,C002,헤라,Hera,010-2222-3333,hera@bcd.com,서울시 강남구 역삼동 13-4,1974-09-23,1500000,9000000,2016-08-24
4,C003,데메테르,Demeter,010-3333-4444,demeter@def.cc.com,서울시 송파구 잠실동 15-5,1978-12-20,2000000,8000000,2018-06-02

---

### 2.2 변경된 라인과 컬럼 위치 찾기

- 두 데이터프레임 비교하여 변경된 경우 True, 변경되지 않은 경우 False
- stack 함수를 이용하여 변경여부 데이터를 reshape
- 변경된 위치의 라인번호와 컬럼명 찾기

In [31]:
(고객정보_V1 != 고객정보_V2)

     고객번호     성명    영문명   전화번호   메일주소     주소     생일   예금잔액   대출잔액    등록일
2   False  False  False   True  False   True  False  False  False  False
3   False  False  False  False  False  False  False  False  False  False
4   False  False  False  False  False  False  False  False   True  False
5   False  False  False  False  False  False  False  False  False  False
6   False  False  False  False  False  False  False  False  False  False
7   False  False  False  False  False  False  False  False  False  False
8   False  False  False  False  False  False  False  False  False  False
9   False  False  False  False  False  False  False  False  False  False
10  False  False  False  False  False  False  False   True  False  False
11  False  False  False   True  False  False  False  False  False  False
12  False  False  False  False  False  False  False  False  False  False
13  False  False  False  False  False  False  False  False  False  False

In [32]:
스택 = (고객정보_V1 != 고객정보_V2).stack()

In [33]:
스택

2   고객번호    False
    성명      False
    영문명     False
    전화번호     True
    메일주소    False
    주소       True
    생일      False
    예금잔액    False
    대출잔액    False
    등록일     False
3   고객번호    False
    성명      False
    영문명     False
    전화번호    False
    메일주소    False
    주소      False
    생일      False
    예금잔액    False
    대출잔액    False
    등록일     False
4   고객번호    False
    성명      False
    영문명     False
    전화번호    False
    메일주소    False
    주소      False
    생일      False
    예금잔액    False
    대출잔액     True
    등록일     False
            ...
11  고객번호    False
    성명      False
    영문명     False
    전화번호     True
    메일주소    False
    주소      False
    생일      False
    예금잔액    False
    대출잔액    False
    등록일     False
12  고객번호    False
    성명      False
    영문명     False
    전화번호    False
    메일주소    False
    주소      False
    생일      False
    예금잔액    False
    대출잔액    False
    등록일     False
13  고객번호    False
    성명      False
    영문명     False
    전화번호    False
    메일주소    False
    주소      False
    생일      False
    예금잔액    False
    대출잔액    False
    등록일     False
Length: 120, dtype: bool

In [34]:
변경라인컬럼 = 스택[스택]

In [35]:
변경라인컬럼

2   전화번호    True
    주소      True
4   대출잔액    True
10  예금잔액    True
11  전화번호    True
dtype: bool

In [36]:
변경라인컬럼.index.names = ['라인번호', '컬럼명']

In [37]:
pd.DataFrame(변경라인컬럼)

              0
라인번호 컬럼명
2    전화번호  True
     주소    True
4    대출잔액  True
10   예금잔액  True
11   전화번호  True

---

### 2.3 변경된 위치의 컬럼 값 비교

In [38]:
import numpy as np

#### numpy를 이용하여 변경된 위치를 행/렬 정보 찾기
- numpy.where() 함수는 데이터프레임 내에서 True인 위치 정보를 추출

In [41]:
변경위치 = np.where(고객정보_V1 != 고객정보_V2)

In [42]:
변경위치

(array([0, 0, 2, 8, 9], dtype=int64), array([3, 5, 8, 7, 3], dtype=int64))

#### 두 데이터프레임의 변경된 위치의 컬럼값 저장

In [43]:
V1 = 고객정보_V1.values[변경위치]
V1

array(['010-1111-2222', '서울시 강서구 화곡동 22-5', 8500000, 5000000,
       '010-1010-3939'], dtype=object)

In [44]:
V2 = 고객정보_V2.values[변경위치]
V2

array(['010-1111-1111', '서울시 양천구 목동 12-3', 8000000, 5200000,
       '010-1010-2020'], dtype=object)

#### 두 데이터프레임의 변경된 위치 컬럼값으로 데이터프레임 생성

- pd.DataFrame([리스트])
- pd.DataFrame({'컬럼명': 리스트, '컬럼명': 리스트})

In [45]:
변경된컬럼값 = pd.DataFrame({'고객정보_V1': V1, '고객정보_V2': V2})
변경된컬럼값

            고객정보_V1          고객정보_V2
0     010-1111-2222    010-1111-1111
1  서울시 강서구 화곡동 22-5  서울시 양천구 목동 12-3
2           8500000          8000000
3           5000000          5200000
4     010-1010-3939    010-1010-2020

#### 변경된 라인 컬럼 정보와 변경된 컬럼 값 병합

In [46]:
변경된컬럼값.index = 변경라인컬럼.index

In [47]:
변경된컬럼값

                    고객정보_V1          고객정보_V2
라인번호 컬럼명
2    전화번호     010-1111-2222    010-1111-1111
     주소    서울시 강서구 화곡동 22-5  서울시 양천구 목동 12-3
4    대출잔액           8500000          8000000
10   예금잔액           5000000          5200000
11   전화번호     010-1010-3939    010-1010-2020